import React from 'react';
import './Text.css';

export const Text = () => {
    return (
        <div className="text">
            <p>
                Красивое слово «эклектика» знакомо многим. Словосочетание «эклектичный стиль» тоже наверняка
                встречалось. Давайте попробуем понять, что за всем этим скрывается. И как знать – возможно, вы решите
                привнести элементы эклектики в свое жилое пространство.
                <br/>
                <br/>
                Само слово «эклектика» имеет древнегреческие корни. В дословном переводе – «выбирающий», «отбирающий». А
                теперь приготовьтесь удивляться: эклектика – это стиль, которого, по большому счету, нет! Оформление
                жилого пространства в эклектичном стиле подразумевает наполнение его индивидуальностью. Вы «выбираете»
                понравившиеся элементы от самых разных стилей – модерна, барокко, бохо, минимализма и многих других. Ото
                всего понемногу, в соответствии с собственными вкусами и пожеланиями. Эклектика – это разнообразие и
                непредсказуемость. Смешение всего и вся. Этакая веселая неразбериха или ералаш.
                <br/>
                <br/>
                <b>Немного истории.</b> Само слово «эклектика» вошло в словари мировых языков несколько столетий назад.
                Но с
                декорированием жилого пространства его стали увязывать относительно недавно по историческим меркам – на
                стыке XIX и XX столетий. Архитекторы и дизайнеры старались уйти от старых шаблонов, они решительно не
                желали сдерживать себя рамками какого-либо определенного стиля. И, кажется, преуспели в «выборе» и
                «сочетании несочетаемого». Да настолько, что «эклектичный стиль» успел войти в моду и пустить глубокие
                корни. Сегодня в широком смысле слова мы толкуем «эклектику», как «всего понемногу» применительно к
                оформлению своего пространства.
                <br/>
                <br/>
                Что же такое эклектичный стиль у вас дома? Теперь вы уже знаете: никаких жестких норм и правил попросту
                не существует. Эклектику создают путем смешения или сопоставления разных элементов декора, но в рамках
                одной целостной темы или идеи. Понятия «анархия» и «эклектика» не являются синонимичными. И кое-какие
                общие принципы, позволяющие считать ваше пространство эклектичным, всё-таки существуют.
                <br/>
                <br/>
                <b>Смешение паттернов.</b> А также их зрительная сочетаемость. Да, паттерны (узоры) могут относиться к
                разным
                стилям. Но зрительно они, безусловно, сочетаемы и органично дополняют друг друга.
                <br/>
                <b>Глобальные влияния.</b> Эклектика точно для вас, если вы любите путешествовать. Индо-Китай,
                Австралия,
                Европа, даже Африка – отовсюду можно привезти на память много интересных вещиц. Но бояться «смешения» не
                надо, особенно когда вы отбираете декор, руководствуясь некими общими принципами. Абсолютно
                разноплановые вещи могут прекрасно смотреться вместе.
                <br/>
                <b>Старое и новое рядом.</b> Винтажная ваза позапрошлого века плюс металл и стекло современности.
                Абракадабра?
                Нет, эклектика. Более того, это может быть красиво.
                <br/>
                <b>Неожиданные элементы и легкая путаница.</b> Бабушкин сундук как журнальный столик. Смело, но имеет
                право на
                жизнь. Прозрачные табуретки возле барной стойки на кухне. Весело и по-своему неповторимо.
                <br/>
                <br/>
                <b>Подводим промежуточный итог:</b> эклектичный стиль – это, по сути, смешение разных стилей и
                направлений. Но
                не в произвольном порядке, а вокруг одной системы, целенаправленной и хорошо продуманной. Перед нами не
                произвольный симбиоз вещей и предметов, а логичное и системное сочетание различных элементов декора.
                <br/>
                <br/>
                <b>Как всё это выглядит?</b>
                Много комнатных растений по всему дому. Этакими зелеными островками. Получается эклектичная атмосфера с
                элементами бохо.
                <br/>
                Эклектичная прихожая. Театр начинается с вешалки, а квартира с прихожей. Добавьте индивидуальности,
                смело сочетайте текстуры, цвета, стили и направления. Посмотрите, насколько органично вписался в
                пространство винтажный ковер.
                <br/>
                Играйте с цветовыми решениями. Любите эксперименты на грани дерзости – эклектичный стиль для вас.
                Смешивайте броские, яркие цвета, не бойтесь играть контрастами.
                <br/>
                Показывайте свои любимые вещи. Иными словами, выставляйте хобби напоказ. Мы же про индивидуальность,
                если вы не забыли. Используя вертикальное пространство, размещайте то, что сочтете важным и нужным.
                <br/>
                Пробуйте, экспериментируйте. Не бойтесь показаться непонятым. Как вам идея оклеить потолок обоями?
                Неожиданная идея. А теперь обдумайте эту идею со всех сторон. Неожиданность – важный элемент эклектики.
                <br/>
                «Галерея искусства». Популярный нынче способ оформления пространства. Только эклектика подразумевает
                здесь чуть большую свободу. Смешивайте всё, что сочтете нужным, ради создания визуального интереса. Но
                только постарайтесь не скатиться в безвкусицу.
                <br/>
                Со всего мира по нитке. Перед вами самый настоящий эклектичный смысл. Помните, мы говорили про
                путешествия и хобби напоказ? Владелец этой квартиры, судя по всему, привозил из каждой поездки по
                глобусу. Не секрет, что в каждой стране эти лучшие друзья географов оформляются со своей изюминкой. Плюс
                книги, учебная литература как элементы эклектичного декора. Посмотрите, какой образ получился на выходе.
                На наш взгляд, смело, неожиданно (да здравствует эклектика), но вполне целостно и интересно.
                <br/>
                <br/>
            </p>
        </div>
    );
}

